app/views/users/edit.html.erb

<%= form_with model: User.find(params[:id]) , url: "/users/:id/edit" do |form| %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]