app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "no more"], ["email", "of@that.com"], ["password", "[FILTERED]"], ["created_at", "2022-09-16 06:24:13.753281"], ["updated_at", "2022-09-16 06:24:13.753281"]]
---
  def create
    @user = User.new(user_params)

    if @user.save